export const hadithData = [
  {
    title: "সহিহ বুখারী",
    hadith: "সর্বমোট হাদিস ৭৩৫৮",
  },
  {
    title: "সুনানে ইবনে মাজাহ",
    hadith: "সর্বমোট হাদিস ৩৭২৯",
  },
  {
    title: "মুয়াত্তা ইমাম মালিক",
    hadith: "সর্বমোট হাদিস ৩৩৭৭",
  },
  {
    title: "রিয়াদুস সলেহিন",
    hadith: "সর্বমোট হাদিস ১২৩৪",
  },
  {
    title: "আদাবুল মুফরাদ",
    hadith: "সর্বমোট হাদিস ২২৮২",
  },
  {
    title: "শামায়েলে তিরমিযি",
    hadith: "সর্বমোট হাদিস ৩৮২৭",
  },
  {
    title: "সহিহ ফাযায়েলে আমল",
    hadith: "সর্বমোট হাদিস ১৭২৯",
  },
  {
    title: "সহিহ মুসলিম",
    hadith: "সর্বমোট হাদিস ৩২৮৮",
  },
];
export const hadithData2 = [
  {
    image: "https://example.com/image1.jpg",
    title: "ওহীর সূচনা অধ্যায়",
    hadith: "হাদিসের রেঞ্জ: ১ - ৭",
  },
  {
    image: "https://example.com/image2.jpg",
    title: "ঈমান",
    hadith: "হাদিসের রেঞ্জ: ৮ - ৫৮",
  },
  {
    image: "https://example.com/image3.jpg",
    title: "ইলম",
    hadith: "হাদিসের রেঞ্জ: ৫৯ - ১৩৪",
  },
  {
    image: "https://example.com/image4.jpg",
    title: "ওজু",
    hadith: "হাদিসের রেঞ্জ: ১৩৫ - ২৪৭",
  },
  {
    image: "https://example.com/image5.jpg",
    title: "গোসল",
    hadith: "হাদিসের রেঞ্জ: ২৪৮ - ২৯৩",
  },
  {
    image: "https://example.com/image6.jpg",
    title: "হায়েজ",
    hadith: "হাদিসের রেঞ্জ: ২৯৪ - ৩৪৮",
  },
  {
    image: "https://example.com/image7.jpg",
    title: "সালাত",
    hadith: "হাদিসের রেঞ্জ: ৩৪৯ - ৫২০",
  },
  {
    image: "https://example.com/image8.jpg",
    title: "আযান",
    hadith: "হাদিসের রেঞ্জ: ৫২১ - ৬০২",
  },
];

export const hadithDetailsData = [
  {
    number: 1,
    name: "আলক্বামাহ ইব্‌নু ওয়াক্কাস আল-লায়সী (রহঃ)",
    subject: "১/১. অধ্যায়ঃ",
    title:
      "حَدَّثَنَا الْحُمَيْدِيُّ عَبْدُ اللَّهِ بْنُ الزُّبَيْرِ، قَالَ حَدَّثَنَا سُفْيَانُ، قَالَ حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الأَنْصَارِيُّ، قَالَ أَخْبَرَنِي مُحَمَّدُ بْنُ إِبْرَاهِيمَ التَّيْمِيُّ، أَنَّهُ سَمِعَ عَلْقَمَةَ بْنَ وَقَّاصٍ اللَّيْثِيَّ، يَقُولُ سَمِعْتُ عُمَرَ بْنَ الْخَطَّابِ ـ رضى الله عنه ـ عَلَى الْمِنْبَرِ قَالَ سَمِعْتُ رَسُولَ اللَّهِ صلى الله عليه وسلم يَقُولُ  إِنَّمَا الأَعْمَالُ بِالنِّيَّاتِ، وَإِنَّمَا لِكُلِّ امْرِئٍ مَا نَوَى، فَمَنْ كَانَتْ هِجْرَتُهُ إِلَى دُنْيَا يُصِيبُهَا أَوْ إِلَى امْرَأَةٍ يَنْكِحُهَا فَهِجْرَتُهُ إِلَى مَا هَاجَرَ إِلَيْهِ",
    hadith:
      "আমি ‘উমর ইব্‌নুল খাত্তাব (রাঃ)-কে মিম্বারের উপর দাঁড়িয়ে বলতে শুনেছিঃ আমি আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)-কে বলতে শুনেছিঃ কাজ (এর প্রাপ্য হবে) নিয়ত অনুযায়ী। আর মানুষ তার নিয়ত অনুযায়ী প্রতিফল পাবে। তাই যার হিজরত হবে ইহকাল লাভের অথবা কোন মহিলাকে বিবাহ করার উদ্দেশ্যে- তবে তার হিজরত সে উদ্দেশ্যেই হবে, যে জন্যে, সে হিজরত করেছে। (৫৪, ২৫২৯, ৩৮৯৮, ৫০৭০, ৬৬৮৯, ৬৯৫৩; মুসলিম ২৩/৪৫ হাঃ ১৯০৭, আহমাদ ১৬৮) ( আধুনিক প্রকাশনী- ১, ইসলামিক ফাউন্ডেশন ১)",
  },
  {
    number: 2,
    name: "উম্মুল মু’মিনীন ‘আয়িশা (রাঃ)",
    subject: "১/২. অধ্যায়ঃ",
    title:
      "حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، قَالَ أَخْبَرَنَا مَالِكٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ أُمِّ الْمُؤْمِنِينَ ـ رضى الله عنها ـ أَنَّ الْحَارِثَ بْنَ هِشَامٍ ـ رضى الله عنه ـ سَأَلَ رَسُولَ اللَّهِ صلى الله عليه وسلم فَقَالَ يَا رَسُولَ اللَّهِ كَيْفَ يَأْتِيكَ الْوَحْىُ فَقَالَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَحْيَانًا يَأْتِينِي مِثْلَ صَلْصَلَةِ الْجَرَسِ ـ وَهُوَ أَشَدُّهُ عَلَىَّ ـ فَيُفْصَمُ عَنِّي وَقَدْ وَعَيْتُ عَنْهُ مَا قَالَ، وَأَحْيَانًا يَتَمَثَّلُ لِيَ الْمَلَكُ رَجُلاً فَيُكَلِّمُنِي فَأَعِي مَا يَقُولُ قَالَتْ عَائِشَةُ رضى الله عنها وَلَقَدْ رَأَيْتُهُ يَنْزِلُ عَلَيْهِ الْوَحْىُ فِي الْيَوْمِ الشَّدِيدِ الْبَرْدِ، فَيَفْصِمُ عَنْهُ وَإِنَّ جَبِينَهُ لَيَتَفَصَّدُ عَرَقًا",
    hadith:
      "হারিস ইব্‌নু হিশাম (রাঃ) আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম)- কে জিজ্ঞেস করলেন, ‘হে আল্লাহর রসূল! আপনার নিকট ওয়াহী কিরূপে আসে?’ আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বললেনঃ [কোন কোন সময় তা ঘন্টা বাজার মত আমার নিকট আসে। আর এটি-ই আমার উপর সবচেয়ে বেদনাদায়ক হয় এবং তা শেষ হতেই মালাক (ফেরেশতা) যা বলেন তা আমি মুখস্ত করে নেই, আবার কখনো মালাক মানুষের রূপ ধারণ করে আমার সাথে কথা বলেন। তিনি যা বলেন আমি তা মুখস্ত করে নেই।] ‘আয়িশা (রাঃ) বলেন, আমি তীব্র শীতের সময় ওয়াহী নাযিলরত অবস্থায় তাঁকে দেখেছি। ওয়াহী শেষ হলেই তাঁর ললাট হতে ঘাম ঝরে পড়ত। (৩২১৫; মুসলিম ৪৩/২৩, হাঃ ২৩৩৩, আহমাদ ২৫৩০৭, ২৬২৫৮) (আধুনিক প্রকাশনীঃ ২, ইসলামী ফাউন্ডেশনঃ ২)",
  },
  {
    number: 3,
    name: "জাবির ইব্‌নু ‘আবদুল্লাহ্‌ আনসারী (রাঃ)",
    subject: "১/৩. অধ্যায়ঃ",
    title:
      "قَالَ ابْنُ شِهَابٍ وَأَخْبَرَنِي أَبُو سَلَمَةَ بْنُ عَبْدِ الرَّحْمَنِ، أَنَّ جَابِرَ بْنَ عَبْدِ اللَّهِ الأَنْصَارِيَّ، قَالَ ـ وَهُوَ يُحَدِّثُ عَنْ فَتْرَةِ الْوَحْىِ، فَقَالَ ـ فِي حَدِيثِهِ بَيْنَا أَنَا أَمْشِي، إِذْ سَمِعْتُ صَوْتًا، مِنَ السَّمَاءِ، فَرَفَعْتُ بَصَرِي فَإِذَا الْمَلَكُ الَّذِي جَاءَنِي بِحِرَاءٍ جَالِسٌ عَلَى كُرْسِيٍّ بَيْنَ السَّمَاءِ وَالأَرْضِ، فَرُعِبْتُ مِنْهُ، فَرَجَعْتُ فَقُلْتُ زَمِّلُونِيفَأَنْزَلَ اللَّهُ تَعَالَى َا أَيُّهَا الْمُدَّثِّرُ * قُمْ فَأَنْذِرْ إِلَى قَوْلِهِ رْ فَحَمِيَ الْوَحْىُ وَتَتَابَعَ  تَابَعَهُ عَبْدُ اللَّهِ بْنُ يُوسُفَ وَأَبُو صَالِحٍ وَتَابَعَهُ هِلاَلُ بْنُ رَدَّادٍ عَنِ الزُّهْرِيِّ وَقَالَ يُونُسُ وَمَعْمَرٌ  بَوَادِرُهُ ",
    hadith:
      "ওয়াহী স্থগিত হওয়া প্রসঙ্গে বর্ণনা করেন যে, আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) বলেছেনঃ একদা আমি হাঁটছি, হঠাৎ আসমান থেকে একটা শব্দ শুনতে পেয়ে আমার দৃষ্টিকে উপরে তুললাম। দেখলাম, সেই ফেরেশতা, যিনি হেরা গুহায় আমার নিকট এসেছিলেন, আসমান ও যমীনের মাঝে একটি আসনে উপবিষ্ট। এতে আমি শংকিত হলাম। অবিলম্বে আমি ফিরে এসে বললাম, ‘আমাকে চাদর দ্বারা আবৃত কর’, ‘আমাকে চাদর দ্বারা আবৃত কর’। অতঃপর আল্লাহ তা’আলা অবতীর্ণ করলেন, “হে বস্ত্রাবৃত রসূল! (১) উঠুন, সতর্ক করুন; আর আপনার রবের শ্রেষ্ঠত্ব ঘোষণা করুন; এবং স্বীয় পরিধেয় বস্ত্র পবিত্র রাখুন; (৫) এবং অপবিত্রতা থেকে দূরে থাকুন”। (সূরা মুদ‌্দাসসির ৭৪/১-৫) অতঃপর ওয়াহী পুরোদমে ধারাবাহিক অবতীর্ণ হতে লাগল। ‘আবদুল্লাহ ইব্‌নু ইউসূফ (রহঃ) ও আবূ সালেহ (রহঃ) অনুরূপ বর্ণনা করেছেন। হিলাল ইব্‌নু রাদদাদ (রহঃ) যুহরী (রহঃ) থেকেও অনুরূপ বর্ণনা করেছেন। ইউনুস ও মা’মার فواده এর স্থলে بَوَادِرُهُ শব্দ উল্লেখ করেছেন। (৩২৩৮, ৪৯২২, ৪৯২৩, ৪৯২৪, ৪৯২৫, ৪৯২৬, ৪৯৫৪, ৬২১৪; মুসলিম ১/৩৮ হাঃ ১৬১, আহমাদ ১৫০৩৯) (আধুনিক প্রকাশনীঃ ৩ শেষাংশ, ইসলামী ফাউন্ডেশনঃ ৩ শেষাংশ)",
  },
  {
    number: 4,
    name: "ইব্‌নু ‘আব্বাস (রাঃ)",
    subject: "১/৪. অধ্যায়ঃ",
    title:
      "حَدَّثَنَا عَبْدَانُ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، عَنِ الزُّهْرِيِّ، ح وَحَدَّثَنَا بِشْرُ بْنُ مُحَمَّدٍ، قَالَ أَخْبَرَنَا عَبْدُ اللَّهِ، قَالَ أَخْبَرَنَا يُونُسُ، وَمَعْمَرٌ، عَنِ الزُّهْرِيِّ، نَحْوَهُ قَالَ أَخْبَرَنِي عُبَيْدُ اللَّهِ بْنُ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ رَسُولُ اللَّهِ صلى الله عليه وسلم أَجْوَدَ النَّاسِ، وَكَانَ أَجْوَدُ مَا يَكُونُ فِي رَمَضَانَ حِينَ يَلْقَاهُ جِبْرِيلُ، وَكَانَ يَلْقَاهُ فِي كُلِّ لَيْلَةٍ مِنْ رَمَضَانَ فَيُدَارِسُهُ الْقُرْآنَ، فَلَرَسُولُ اللَّهِ صلى الله عليه وسلم أَجْوَدُ بِالْخَيْرِ مِنَ الرِّيحِ الْمُرْسَلَةِ",
    hadith:
      "তিনি বলেন আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) ছিলেন সর্বশ্রেষ্ঠ দানশীল। রমাযানে তিনি আরো অধিক দানশীল হতেন, যখন জিবরীল (‘আঃ) তাঁর সঙ্গে সাক্ষাৎ করতেন। আর রমাযানের প্রতি রাতেই জিবরীল (‘আঃ) তাঁর সাথে দেখা করতেন এবং তারা একে অপরকে কুরআন তিলাওয়াত করে শোনাতেন। নিশ্চয়ই আল্লাহর রসূল (সাল্লাল্লাহু ‘আলাইহি ওয়া সাল্লাম) রহমতের বায়ু অপেক্ষাও অধিক দানশীল ছিলেন। (১৯০২, ৩২২০, ৩৫৫৪, ৪৯৯৭; মুসলিম ৪৩/১২ হাঃ ৩২০৮, আহমাদ ৩৬১৬, ৩৪২৫) (আধুনিক প্রকাশনীঃ ৫, ইসলামী ফাউন্ডেশনঃ ৫",
  },
  
];

